Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །བདག་གིས་ལྟ་བའི་རྒྱ་མོ་བཅད་ཅིང་གྲོལ་ནས་འགྲོ་བ་བསྒྲལ་བར་བགྱི།
en: May I tear apart the net of craving; when I am saved, may I save the world!

source: །ཇི་སྲིད་ཀྱིས་ནི་སངས་རྒྱས་འགྱུར་བ་མི་ཡི་དམ་པ་ལུང་བསྟན་གསོལ།
en: Please tell me, O best of humans, when will I become a buddha?

source: །སྡུག་བསྔལ་ཆུ་བོས་བདས་པའི་སེམས་ཅན་སྲིད་པའི་མཚོ་ལས་བསྒྲལ་བར་བགྱི།
en: “I will ferry beings across the river of suffering, free them from the ocean of existence,

source: །མྱ་ངན་འདས་པའི་བདེ་བ་ཟག་པ་མེད་པའི་ལམ་ལ་དགོད་པར་བགྱི།
en: And establish them on the path to the undefiled bliss of nirvāṇa.

source: །ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་གང་རྣམས་ཡོན་ཏན་རྒྱ་མཚོ་ལྟ་བུ་དག །དེ་དག་བདག་གིས་དཔང་དུ་གསོལ་ཏེ་བྱང་ཆུབ་ཏུ་ནི་སེམས་གཞོལ་བགྱི།
en: I beg any buddhas living in the ten directions, ocean-like with their vast qualities, To be my witness—for I commit my mind to awakening. “ May the suffering of all beings

source: །དྲག་ཅིང་མི་བཟད་རྩུབ་པའི་སྡུག་བསྔལ་དག་གིས་རེག་པའི་སེམས་ཅན་ཀུན།
en: Touched by violent, rough, and unbearable pain be pacified today

source: །དུས་གསུམ་གྱི་ནི་བདག་གི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་བསོད་ནམས་དེས། །སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་དེ་རིང་ཞི་བར་གྱུར་ཅིག་སེམས་ཅན་ཀུན།
en: By the power of merit accumulated by me in the three times with my body, speech, and mind.

source: །སངས་རྒྱས་ཀྱི་ནི་བདེ་དང་ལྡན་ཞིང་རྟག་ཏུ་མྱ་ངན་འདས་པར་ཤོག །སེམས་ཅན་ཐམས་ཅད་ནད་ཞིར་གྱུར་ཅིག་ཉོན་མོངས་ཆུ་ཡང་སྐམས་པར་ཤོག །ངོ་བོ་ཉིད་ཀྱི་ཡེ་ཤེས་དབང་པོའི་སྙིང་པོ་ལྡན་པ་ཐོབ་གྱུར་ཅིག །སེམས་ཅན་གང་དག་གསད་པར་ཆད་ཅིང་སྡུག་བསྔལ་དག་གིས་གཙེས་པ་རྣམས།
en: May all beings attain the bliss of the buddhas and find lasting nirvāṇa. “May the maladies of all beings be quelled and the waters of afflictions dried up! May they obtain wisdom and sound sense faculties! May I swiftly liberate, through the brilliant splendor of my merit, All the beings overwhelmed by suffering, cut down by death!

source: །དེ་དག་བདག་གི་བསོད་ནམས་གཟི་བརྗིད་དག་གིས་མྱུར་དུ་ཐར་བར་ཤོག །སེམས་ཅན་རེ་རེས་ཀྱང་ནི་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ཐོབ་གྱུར་ཅིག །ཤེས་རབ་བསོད་ནམས་ཚད་མེད་པ་དང་བདེ་བ་ཀུན་གྱིས་ཚིམ་པར་ཤོག །དེ་དག་སྡིག་པའི་རྣམ་སྤངས་ལྟ་བ་མཉམ་ཉིད་མྱུར་དུ་བསྟེན་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་སྐྱེ་བ་དྲན་ཅིང་ཆོས་ལ་སྤྱོད་པ་ཉིད་དུ་ཤོག །སེམས་ཅན་དེ་ཀུན་ཆོས་གྲུས་སྲིད་པའི་རྒྱ་མཚོ་ཕ་རོལ་རྒལ་གྱུར་ཅིག །ཐམས་ཅད་ཆོས་ཀྱི་ཕ་རོལ་ཕྱིན་པ་སངས་རྒྱས་སུ་ཡང་གྲུབ་པར་ཤོག །བསྐལ་པ་དཔག་ཏུ་མེད་པར་ཆོས་ཀྱི་ཆར་པ་འབེབས་ཤིང་འདུག་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཆུས་ལེགས་པར་འཁྲུ་བར་ཤོག །བདག་གི་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ནོངས་པ་ཅུང་ཟད་ཅི་བགྱིས་པ།
en: “May all beings, each and every one of them, attain an ocean of qualities! May they be satisfied with knowledge, limitless merit, and all pleasures! May they attend to the abandoning of negativities and the view of equality! May they all remember their previous births and practice the Dharma! “May they all cross to the other shore of the ocean of existence on the raft of Dharma! May all reach the far shore of Dharma! May all become buddhas! May the rain of the Dharma fall and then remain for immeasurable eons! May all beings be bathed in the water from this Dharma cloud! “Whatever subtle transgressions I have committed with my body, speech, and mind,

source: །སངས་རྒྱས་ཐམས་ཅད་དཔང་དུ་གསོལ་ཏེ་གུས་པར་བགྱིས་ནས་སོ་སོར་བཤགས།
en: I humbly confess, begging all the buddhas to be my witness!

source: །བདག་ཀྱང་ཕྱིན་ཆད་སྡིག་ལ་ལྟ་བའི་ལས་རྣམས་སྤྱོད་པར་མ་གྱུར་ཅིག །རྟག་ཏུ་མདུན་ན་བསམ་གྱིས་མི་ཁྱབ་གང་ཟག་མཆོག་བཞུགས་མཐོང་བར་ཤོག །བདག་གི་བསོད་ནམས་ཅུང་ཟད་ཅི་མཆིས་དེང་དེ་བྱང་ཆུབ་བསྔོ་བར་བགྱི།
en: May I never again commit such deeds inspired by evil views! May I see such inconceivably supreme beings always before me! “Whatever little merit I have accumulated I dedicate to awakening.

source: །སེམས་ཅན་ཆེད་དུ་སྤྱོད་པ་ཀུན་དང་སྡུག་བསྔལ་ཐམས་ཅད་སྤྲོ་བར་བགྱི།
en: For the sake of beings, I will perform any action and endure any suffering.

source: །སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་མཆོག་གི་ལམ་དུ་རབ་ཏུ་གཟུད་པར་བགྱི།
en: I will bring all beings onto the supreme path of awakening.

source: །བསྐལ་པར་ཞིང་དང་ཡེ་ཤེས་སེམས་ཅན་རྒྱ་མཚོ་རྣམ་པར་སྦྱང་བར་བགྱི།
en: For eons I will purify buddha fields, wisdom, and the ocean of beings.

source: །གང་དུ་བྱང་ཆུབ་རེག་འགྱུར་ཞིང་ཡང་རྣམ་པར་དག་པ་ཐོབ་པར་བགྱི།
en: “May I reach the place where I touch awakening and attain purification.

source: །འཁོར་ཀུན་རྣམ་པར་དག་ཅིང་བཟོད་པའི་ས་ལ་རབ་ཏུ་གནས་པར་ཤོག །སྨྲ་བའི་སེང་གེ་ངེས་པར་མངོན་པར་ཤེས་པ་ལྔ་རྣམས་ཐོབ་པར་ཤོག །འདྲེན་པ་ཆགས་མེད་ཡེ་ཤེས་ལྡན་ཞིང་ཐམས་ཅད་གཟིགས་པ་ལུང་བསྟན་གསོལ།
en: May my whole retinue be purified and abide on the level of acceptance. O leonine speaker, may I attain the five superknowledges. O leader with your unimpeded wisdom and omniscience, please make my prophesy!

source: །འཇིག་རྟེན་དུ་ཡང་སངས་རྒྱས་ཆོས་ཀུན་ཁ་ལོ་བསྒྱུར་བར་འགྱུར་ཞེ་ན།
en: “If I should become a buddha, a paragon of all the qualities of buddhahood in this world,

source: །མེ་ཏོག་སིལ་མ་གཏོར་བ་ནམ་མཁའ་ལ་ནི་གདུགས་སུ་གནས་པར་ཤོག །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་མི་རྣམས་ལྷགས་པ་ཀུན་ཀྱང་དཔང་གྱིས་ཤིག །ས་རྣམས་གཡོ་བར་བྱེད་ཅིང་ཁྱོད་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཤོག །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་མེ་ཏོག་དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེའི་སྟེང་ལོགས་སུ་གཏོར་བ་དང་། མེ་ཏོག་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་གདུགས་གཅིག་ཏུ་གྱུར་ནས་འདུག་སྟེ།
en: May I cast loose flowers upon you and shade you with a parasol! May the gods, nāgas, yakṣas, and the rest of the people be my witness, And may the Earth, trembling, bow her head to your feet.” Then the sage Jyotīrasa cast the flowers he had just spoken of upon the Blessed One, and they became a single parasol floating above the crown of his head.

source: དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་དེ་མཐོང་ནས་རབ་ཏུ་ཟང་ཟིང་མེད་ཅིང་མཆོག་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བས་ཚིམ་པ་སྐྱེས་པར་གྱུར་ཏེ།
en: When he saw this, satisfying feelings of tremendous and extraordinary joy and pleasure arose in Jyotīrasa’s mind.

source: དེ་ནས་པུས་མོའི་ལྷ་ང་གཉིས་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་སོ།
en: He fell to his knees and touched the Blessed One’s feet.

source: །དྲང་སྲོང་ཆེན་པོ་སྐར་མ་ལ་དགའ་བས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་མ་ཐག་ཏུ་དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: As soon as he did so, the entire great trichiliocosm shook in six different ways.

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གང་དག་དེར་ལྷགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡིད་སྐྱོ་ཞིང་ལྟད་མོར་གྱུར་ཏོ།
en: The hundreds of thousands of millions of billions of beings who were there became so moved that they beheld a vision.

source: །གང་དག་གླང་པོ་ཆེས་འདུལ་བའི་སེམས་ཅན་དེ་དག་གིས་ནི་བདེ་བར་གཤེགས་པ་གླང་པོ་ཆེའི་གཟུགས་སུ་མཐོང་ནས་ཡིད་དགའ་བར་གྱུར་ཅིང་དྲང་སྲོང་ཆེན་པོ་སྐར་མ་ལ་དགའ་བས་མེ་ཏོག་གཏོར་བ་དེ་དག་སྟེང་གི་བར་སྣང་ལ་གདུགས་སུ་གྱུར་ཏེ་གནས་པ་དང་ས་གཡོས་པ་དེ་ཡང་མཐོང་ནས་རབ་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Those beings who were capable of being guided by elephants perceived the Blissful One in the form of an elephant. They were overjoyed. When they saw the flowers cast by the great sage transformed and floating in the sky as a parasol and the earth shaking, they fell to the Blessed One’s feet in amazement.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་སོ། །གང་དག་ཡང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་ནི་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏོ།
en: Those who were capable of being guided by buddhas all perceived the Blessed One in the guise of a buddha and were wonderstruck.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལས་བཞེངས་པ་དང་། སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་དེ་དག་གིས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་པར་མཐོང་ནས་ཟང་ཟིང་མེད་ཅིང་མཆོག་ཏུ་དགའ་བ་དང་། མགུ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ན་བཟའ་དང་། ཕྱང་འཕྲུལ་དང་། རྒྱན་ཇི་སྙེད་པ་དག་གིས་གཏོར་ཏོ།
en: When the Blessed One then emerged from his absorption, becoming indestructible , those beings who were capable of being guided by buddhas felt joyous and exhilarated on seeing him emerge and showered him with all the flowers, incense, perfume, garlands, scented oils, clothes, ornaments, and adornments they had.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: For this occasion, the Blessed One, addressing Jyotīrasa, uttered the following stanzas:

source: །དྲང་སྲོང་ཆེན་པོ་མྱུར་དུ་ལོངས་ལ་ཉོན།
en: “O great sage! Rise up and listen as I am making a prediction.

source: །བྱང་ཆུབ་ལུང་བསྟན་ཞེས་ནི་འདྲེན་པ་གསུང་།
en: The guide is making your prediction of awakening.

source: །མཉམ་པ་མེད་པའི་མཐུས་ནི་ས་གཡོས་ཤིང་།
en: Through unequaled power, the earth shook

source: །ནམ་མཁའ་ལ་ཡང་མེ་ཏོག་གདུགས་གཅིག་འདུག །ཁྱོད་ནི་འཇིག་རྟེན་ཕན་ཕྱིར་སྟོན་དབང་པོ།
en: And flowers became a parasol floating in the sky.

source: །རྐང་གཉིས་བདག་གི་གཙོ་བོ་སངས་རྒྱས་སུ།
en: “You will become the best of two-legged creatures, A powerful buddha and instructor who teaches to benefit the world,

source: །བསོད་ནམས་མཐའ་ཡས་ནམ་མཁའ་ཚད་མཉམ་པ།
en: One of infinite merit, vast as the sky,

source: །ཁམས་གསུམ་སྙིང་པོ་འགྲོ་བའི་སྒྲོན་མར་འགྱུར།
en: The best in the threefold universe, and a lamp for the world.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གང་དུ་བདག་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཅི་འདྲ་བར་འགྱུར།
en: Jyotīrasa, the bodhisattva great being, then asked, “In what buddha field will I turn the wheel of the Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱོད་ནི་བསྐལ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ན། བྱང་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་མེ་ཏོག་རྒྱས་པའི་དྲི་ཞེས་བྱ་བ་འབྱུང་སྟེ།
en: The Blessed One replied, “In countless eons, you will appear in a buddha field to the north called Extensive Scent of Flowers.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཇི་ལྟར་ད་ལྟར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་བཞིན་དུ་བཀོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པར་འགྱུར་རོ།
en: This buddha field will be arranged just as the present-day world of Sukhāvatī is.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེས་བུ་དམ་པ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: You will fully awaken to unsurpassed and perfect buddhahood in this buddha field.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: You will be a thus-gone, worthy, perfect buddha, someone learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, and a teacher of gods and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྡུལ་མེད་སྤོས་སྣང་སྐར་མའི་དཔལ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: You will be known as the blessed buddha Immaculate Fragrant Star of Bright Splendor.

source: ཁྱོད་ཀྱི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅུ་ཐུབ་པར་འགྱུར་རོ།
en: Your lifespan will extend to an intermediate eon.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་མེད་ཅིང་།
en: There will be no hearers or solitary buddhas in your buddha field;

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབའ་ཞིག་གི་གནས་སུ་འགྱུར་ཏེ།
en: it will be a realm exclusive to bodhisattva great beings.

source: ཁྱོད་ཀྱང་དེ་ན་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་སྟོན་པར་འགྱུར་རོ།
en: You will only give Great Vehicle teachings there.”

source: །འཁོར་ཇི་སྙེད་ལྷགས་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བ་ལུང་བསྟན་པ་དེ་ཐོས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ལས་ལ་མངོན་པར་བརྩོན་པར་གྱུར་ཏོ།
en: When the assembly that had amassed there heard the prophecy of the bodhisattva great being Jyotīrasa, they exerted themselves in venerating the Blessed One.

source: །བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་དེ་དག་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏེ།
en: The five hundred young brahmins and ninety-two trillion other beings there developed the mind directed toward unsurpassed and perfect awakening.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པ་ཞེས་བྱ་བ་ཐོབ་བོ། །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས།
en: They achieved the bodhisattva absorption called not forgetting the mind of awakening

source: དྲང་སྲོང་སྐར་མ་ལ་དགའ་བའི་ལེའུ་སྟེ་བཞི་པའོ།།
en: This concludes the chapter on the sage Jyotīrasa, the fourth in the “ Ratnaketu Dhāraṇī

source: །།བམ་པོ་ལྔ་པ།
en: Chapter

source: དེ་ནས་བདུད་བྱེ་བ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་གྲོང་ཁྱེར་འདིའི་ཕྱི་རོལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དག་གིས་བརྒྱན་པ་དེ་བཞིན་དུ་བདག་ཅག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་འདིའི་སྒོ་གང་དང་གང་ནས་གཤེགས་པ་དེའི་སྒོ་དེ་དང་དེའི་ས་ཕྱོགས་བཀོད་པའི་རྒྱན་དམ་པ་ཁྱད་པར་དུ་འཕགས་པས་བརྒྱན་ཏོ་སྙམ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ཀྱིས་བདུད་བྱེ་བ་དེ་དག་གི་སེམས་ཀྱི་ཀུན་ཏུ་རྟོག་པ་མཁྱེན་ནས། འདི་འདྲ་བའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་མཛད་དེ།
en: The millions of māras then thought, “We should adorn the gates of the city through which the Blessed One is to enter, as well as the earth surrounding them, with sublime and magnificent ornaments in the same manner as the gods, nāgas, and yakṣas have adorned the surroundings of the city.”

source: དེ་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་མཛད་པས། །གྲོང་ཁྱེར་གྱི་སྒོ་བཅུ་གཉིས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཅུ་གཉིས་གྲོང་ཁྱེར་གྱི་སྒོ་རེ་རེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་སོ།
en: With his mind, however, the Blessed One knew the thoughts of the millions of māras, and he manifested a miracle such that through the twelve gates of the city, twelve blessed buddhas entered the city of Rājagṛha.

source: །བདུད་བྱེ་བ་དེ་དག་ཀྱང་ནམ་མཁའ་ལ་གནས་བཞིན་དུ་བདུད་ཀྱི་ཡུལ་གྱི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པའི་རྫུ་འཕྲུལ་གྲངས་མེད་པ་དང་ལྡན་པ། བཀོད་པའི་མཆོག་རྣམས་དང་། བཀོད་པ་མཛེས་པ་རྣམས་ཀྱིས་གྲོང་ཁྱེར་གྱི་སྒོ་དེ་དག་དང་། སའི་ཕྱོགས་དེ་དག་དང་། རྩིག་པ་དེ་དག་དང་། ཤིང་དེ་དག་དང་། སའི་ངོས་དེ་དག་བརྒྱན་ཏོ།
en: The millions of māras then, while hovering in the sky, adorned the city gates, the area around them, the city walls, its trees, and the surface of the earth with magical ornaments of the māra realm, as well as countless other magnificent miraculous manifestations set in the finest and most beautiful arrangements.

source: །བདུད་བྱེ་བ་དེ་དག་དང་། བདུད་ཀྱི་འཁོར་དེ་དག་ལ་ལ་ནི་ཚངས་པའི་ཆ་བྱད་ལྟ་བུ་ནས་དྲང་སྲོང་ཆེན་པོའི་ཆ་བྱད་ལྟ་བུའི་བར་དུ་བསྒྱུར་ཏེ་ནམ་མཁའ་ལ་གནས་བཞིན་དུ་ཁང་པ་བརྩེགས་པ་དེ་དག་གི་སྐར་ཁུང་དང་། རྟ་བབས་དང་། བ་གམ་དང་། སྐྱེད་ཤིང་གི་ནང་དུ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་དང་། གོས་དང་། རས་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་དང་། ལྷབ་ལྷུབ་ཀྱི་རྒྱན་རྣམས་ཀྱི་ཆར་ནི་རབ་ཏུ་ཕབ།
en: Some of the millions of māras transformed into guises ranging from that of Brahmā to those of great sages. From their perch in the sky, they placed various flowers, incense, scented powders, garlands, gold, silver, jewels, and pearls on the windows, ledges, and turrets of the mansions in the city, as well as in the trees.

source: སིལ་སྙན་དང་། དཀྲོལ་བ་སྣ་ཚོགས་ནི་དཀྲོལ་ནས་བསྟོད་པ་དང་། ཡོན་ཏན་བསྔགས་པ་སྣ་ཚོགས་ཀྱི་དབྱངས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་དོ།
en: They also cast down a rain of cloth, cotton, linen, and ornaments, played many instruments, and venerated the Blessed One with songs of praise, extolling his qualities.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཆེན་པོ་སྔོན་མ་ཐོས་པའི་བཀོད་པ་མཆོག་ཏུ་རྒྱ་ཆེ་བ།
en: The Blessed One then entered Rājagṛha’s city gates, adorned as they were with a supremely extensive and elevating display made in such a novel, incredible, and miraculous fashion.

source: ཁྱད་པར་དུ་འཕགས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྒོ་ན་བཞུགས་ཏེ། ཞབས་གཡས་པའི་མཐེ་བོས་སྒོའི་ཐེམ་པ་ལ་རེག་པར་མཛད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་སྒོའི་ཐེམ་པ་ལ་རེག་མ་ཐག་ཏུ།
en: As he entered, he touched the threshold of the city gate with the big toe of his right foot.

source: དེ་ནས་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རབ་ཏུ་གཡོས་སོ།
en: As soon as he did so, the entire great trichiliocosm shook in six different ways.

source: །གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དག་དང་། ས་དང་། ཆུ་དང་། རྒྱ་མཚོ་ཆེན་པོ་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་གྱི་ལྷ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། ལྷའི་དྲང་སྲོང་ཆེན་པོའི་འཁོར་དང་། འོག་མིན་གྱི་བར་ནས་བཟུང་སྟེ།
en: This earthquake was felt by Śakra, Brahmā, Sūrya, Candra, the world protectors, and Maheśvara, as well as all leaders of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, and also by the gods of the earth, water, oceans, cities, and countryside. It was also felt by all the men, women, boys, and girls and all the retinues of the divine great sages up to the Unexcelled Heaven.

source: སེམས་ཅན་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་དེ་དག་ཐམས་ཅད་ས་གཡོས་པར་སྣང་བ་དེས་བསྐུལ་མ་ཐག་ཏུ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཁོ་ར་ཁོར་ཡུག་ཏུ་བསྐོར་ནས་ས་དང་ནམ་མཁའ་ལ་གནས་ཤིང་མེ་ཏོག་དང་། སྤོས་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཕྱེ་མའི་བར་གྱིས་བཅོམ་ལྡན་འདས་ལ་གཏོར་ཏོ།
en: The earthquake immediately mobilized all these majestic beings to gather at the area surrounding the city of Rājagṛha. From the ground below and the sky above, they cast flowers and incense powder, suitable to the season, toward the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མེ་ཏོག་དང་། ཕྱེ་མའི་བར་དེ་དག་ཕྱོགས་བཅུའི་ཕྱོགས་ཀྱི་ཆ་རེ་རེ་ན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་མ་དག་པ་དང་། སྟོང་པ་དང་། མི་སྟོང་པ་རྣམས་སུ་སངས་རྒྱས་ལ་མཆོད་ཅིང་བསྟི་སྟང་བྱ་བའི་ཕྱིར་ནམ་མཁའ་ལ་གཏོར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་མེ་ཏོག་དང་། ཕྱེ་མ་དང་། རྒྱན་དེ་དག་ལས་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་།
en: The Blessed One then scattered the flowers, powders, and so forth into each of the ten directions in order to venerate and honor the buddhas in all the buddha fields—pure as well as impure, empty as well as not empty—that are as numerous as the atoms in existence. The following verses then rang out from the flowers, powders, and ornaments in those buddha fields:

source: །མྱུར་དུ་སད་པར་གྱིས་ལ་འདི་དག་ལྟོས།
en: “Quickly, wake up! Consider these things.

source: །བྱང་ཆུབ་ཕྱིར་ནི་བག་ཡོད་སྤྱད་པ་སྤྱོད། །ཁྱོད་ཀྱི་འཁོར་བའི་གཅོང་རོང་འཁྱམས་པ་ཡི།
en: Act conscientiously for awakening.

source: །འཇིག་རྟེན་ཐམས་ཅད་དག་ནི་བསྒྲལ་བར་བྱོས།
en: Liberate all the beings Wandering in the chasm of saṃsāra!

source: །ཡོངས་སུ་སྨིན་དང་ལྡན་པའི་དུས་བབ་ཀྱིས།
en: “As the time is ripe,

source: །གཡེང་བར་གྱུར་པ་རབ་ཏུ་མྱུར་ཐོང་ལ།
en: Give up all distractions.

source: །འདིར་ནི་སྔོན་གྱི་དམ་བཅས་ཡིད་ལ་བྱོས།
en: Bring your past promises to mind

source: །བྱང་ཆུབ་ལུང་བསྟན་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: And you will attain the prophecy of awakening.

source: །ཐུབ་དབང་དྲང་སྲོང་ཆེན་པོ་མྱ་ངན་མེད།
en: “The lord of sages, the great sage for whom there is no anguish,

source: །འགྲོ་ལ་ཕན་ཕྱིར་དེ་རིང་གྲོང་ཁྱེར་གཤེགས།
en: Has come to the city today to benefit beings.

source: །བདུད་སྟོང་བྱེ་བ་རང་གིས་ཕམ་མཛད་དེས།
en: He has defeated billions of māras,

source: །ད་ནི་ཆོས་ཀྱི་འཁོར་ལོ་མྱུར་དུ་བསྐོར།
en: So the wheel of Dharma is set to be turned.

source: །གྲོགས་པོ་ཞི་བ་འདི་ལ་འགྲོ་དགའ་མཛད།
en: “Friends! He is delighting beings in this state of peace!

source: །དཔའ་མཆོག་དངོས་པོ་ཡང་དག་སྟོན་པར་མཛད།
en: He is displaying the substance of his supreme courage!

source: །འགྲོ་བ་སྡུག་བསྔལ་དག་ལས་ཐར་མཛད་ནས།
en: Having liberated beings from their suffering,

source: །བྱང་ཆུབ་ཏུ་ནི་དེ་རིང་ལུང་ཡང་སྟོན།
en: He will grant prophecies of awakening today!

source: །རང་བྱུང་མྱ་ངན་མེད་པ་གྲོང་ཁྱེར་གཤེགས།
en: “The self-arisen one has entered the city that is beyond misery.

source: །དེ་ཕྱིར་ཞིང་དེར་རབ་ཏུ་མྱུར་གཤེགས་ལ།
en: Therefore, hasten to that buddha field!

source: །དེ་ལྟར་མཛེས་པ་དེ་དག་རབ་ལྟོས་ཏེ།
en: Behold those beautiful things there

source: །རིམ་གྱིས་བྱང་ཆུབ་ཏུ་ཡང་འགྱུར་བར་བྱོས།
en: And gradually orient yourselves toward awakening!”

source: །ཡང་དེའི་ཚེ་འོད་མའི་ཚལ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ཉན་ཐོས་དང་། ཉན་ཐོས་ཆེན་པོ་གང་དག་ནང་དུ་ཡང་དག་པར་འཇོག་ལ་གནས་པ་དེ་དག་གིས་སྟོན་པ་དེ་ལ་བལྟས་པ་དང་། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྒོ་ན་འདུལ་བ་ལ་གཞེས་ཤིང་བཞུགས་པ་མཐོང་ངོ་།
en: Then the bodhisattva great beings, hearers, and great hearers who were settled in mental composure in the grove of Veṇuvana gazed at the Teacher. They saw that the Blessed One was at the gate of the city of Rājagṛha, calm and collected.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་སུ་འཁོད་པ་དང་། བཀོད་པ་ཆེན་པོ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: All these bodhisattva great beings and great hearers also saw the ranks and formations on the edges at the Blessed One’s sides.

source: །དེ་ནས་མེ་ཏོག་དང་། ཕྱེ་མའི་རྒྱན་དེ་དག་ལས་ཚིགས་སུ་བཅད་པའི་སྒྲ་གང་བྱུང་བ་དེ་དག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་མ་དག་པ་དང་། སྟོང་པ་དང་། མི་སྟོང་པ་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཐམས་ཅད་དུ་གང་བར་གྱུར་ཏོ།
en: The sound of the verses that came from the flower and powder decorations then rang out in the buddha fields—pure and impure, empty and not empty—as numerous as the atoms existing throughout the ten directions.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ཉན་ཐོས་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། ཡིད་དུ་འོང་བ་འདི་ལྟ་བུ། རོ་མྱང་བར་འོས་པ་འདི་ལྟ་བུ།
en: When the bodhisattva great beings and hearers in those buddha fields heard the sound, they thought, “How pleasing this sound is.

source: དགའ་བར་བྱ་བར་འོས་པ་འདི་ལྟ་བུ།
en: How enjoyable, delightful, satisfying, and pleasant it is.

source: ཚིམ་པར་བྱེད་པར་འོས་པ་འདི་ལྟ་བུ།
en: Its great qualities are indeed worthy of praise.

source: སྤྲོ་བར་བྱེད་པ་འདི་ལྟ་བུའི་ཡོན་ཏན་ཆེན་པོ་བརྗོད་པར་འོས་པ་འདི་ལྟ་བུའི་སྒྲ་འདི་དག་དང་། མེ་ཏོག་དང་། ཕྱེ་མའི་ཆར་འདི་དག་ག་ལས་འོངས་སྙམ་མོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་རང་གི་དགེ་བའི་ཕྱོགས་བཏང་སྟེ་ངོ་མཚར་ཆེར་འཛིན་པར་གྱུར་ཏོ།
en: Now, whence have this sound and this rain of flowers and powders come?” The bodhisattva great beings and great hearers thus halted their individual virtuous activities in utter amazement.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་སངས་རྒྱས་ཀྱི་རྒྱན་དང་ལྷབ་ལྷུབ་ཀྱི་རྒྱུ་འཐུན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: The blessed, thus-gone Śākyamuni then entered into an absorption called corresponding to the causes of the Buddha’s ornaments and jewelry

source: །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་རྒྱན་དང་ལྷབ་ལྷུབ་ཀྱི་རྒྱུ་འཐུན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བཀོད་པ་ཆེན་པོ་འདི་ལྟ་བུ་དག་སྣང་སྟེ། འདི་ལྟ་སྟེ།
en: As soon as he entered this absorption, an immense display appeared throughout this entire Sahā world and all the buddha fields throughout the ten directions.

source: མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་ཅིང་རྡུལ་བསགས་པ་མེད་ཅེས་བྱ་བ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་འདི་འདྲ་བ་དང་ལྡན་པར་འགྱུར།
en: They all became just like the future thus-gone Samantadarśin’s buddha field, which is called Pure and Unstained.

source: རྩིག་པ་མེད་ལ་ལེགས་པར་བརྒྱན་པའི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཐམས་ཅད་དུ་ཡང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྒོ་ན། ཤིན་ཏུ་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེར་བཞུགས་པར་སྣང་བ་ནི་མ་གཏོགས་སོ།
en: In all the buddha fields with their world systems as numerous as atoms, throughout the ten directions, that were all unconstructed yet marvelously adorned, the blessed, thus-gone Śākyamuni appeared—clearly, precisely, and brilliantly—entering the city gates of Rājagṛha.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་སྒྲ་ཐོས་པ་དེས་བསྐུལ་བ་དང་། ཕྱོགས་བཞིར་བལྟ་ཞིང་འཁོད་དེ།
en: As the bodhisattva great beings and great hearers in those buddha fields heard these sounds, they were intrigued.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ཧ་ཅང་ཡང་མི་རིང་བ་ན་འདུག་པར་མཐོང་ངོ་།
en: Gazing in all directions, they all saw the Sahā world—not very far away.
